{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "google/flan-t5-base",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 8,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "k",
    "wi",
    "o",
    "q",
    "wo",
    "v"
  ],
  "task_type": "SEQ_2_SEQ_LM",
  "use_dora": true,
  "use_rslora": false
}