{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "google/flan-t5-base",
  "beta1": 0.85,
  "beta2": 0.85,
  "bias": "none",
  "deltaT": 1,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "init_r": 12,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 8,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "orth_reg_weight": 0.5,
  "peft_type": "ADALORA",
  "r": 16,
  "rank_pattern": null,
  "revision": null,
  "target_modules": [
    "q",
    "k",
    "v",
    "o",
    "wi",
    "wo"
  ],
  "target_r": 8,
  "task_type": "SEQ_2_SEQ_LM",
  "tfinal": 0,
  "tinit": 0,
  "total_step": null,
  "use_dora": false,
  "use_rslora": false
}