{
  "auto_mapping": null,
  "base_model_name_or_path": "t5-base",
  "fan_in_fan_out": false,
  "feedforward_modules": [
    "wo"
  ],
  "inference_mode": true,
  "init_ia3_weights": true,
  "modules_to_save": null,
  "peft_type": "IA3",
  "revision": null,
  "target_modules": [
    "k",
    "v",
    "wo"
  ],
  "task_type": "SEQ_2_SEQ_LM"
}
